app/controllers/cadastro_trabalhos_controller.rb

  def index
    @cadastro_trabalhos = CadastroTrabalho.all
---
SELECT "cadastro_trabalhos".* FROM "cadastro_trabalhos"

  def create
    @cadastro_trabalho = CadastroTrabalho.new(cadastro_trabalho_params)

    respond_to do |format|
      if @cadastro_trabalho.save
---
INSERT INTO "cadastro_trabalhos" ("titulo", "nome", "arquivo", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "Jogos"], ["nome", "Robério"], ["arquivo", ""], ["data", "2016-05-31"], ["created_at", "2016-05-31 23:33:04.976778"], ["updated_at", "2016-05-31 23:33:04.976778"]]

  def update
    respond_to do |format|
      if @cadastro_trabalho.update(cadastro_trabalho_params)
---
UPDATE "cadastro_trabalhos" SET "titulo" = $1, "updated_at" = $2 WHERE "cadastro_trabalhos"."id" = $3  [["titulo", "Jogos União"], ["updated_at", "2016-06-08 00:00:08.507404"], ["id", 1]]

  def destroy
    @cadastro_trabalho.destroy
---
DELETE FROM "cadastro_trabalhos" WHERE "cadastro_trabalhos"."id" = $1  [["id", 2]]

    def set_cadastro_trabalho
      @cadastro_trabalho = CadastroTrabalho.find(params[:id])
---
SELECT  "cadastro_trabalhos".* FROM "cadastro_trabalhos" WHERE "cadastro_trabalhos"."id" = $1 LIMIT 1  [["id", 2]]